[
    {
        topic: "Basic Concepts of Differential Equations",
        question: "Explain the difference between an ordinary differential equation (ODE) and a partial differential equation (PDE), and provide an example of each.",
        correct_answer: "An ordinary differential equation (ODE) involves derivatives of a dependent variable with respect to only one independent variable. For example, $ \frac{d^2y}{dx^2} + y = 0 $ is an ODE. A partial differential equation (PDE) involves derivatives with respect to multiple independent variables. For example, $ \frac{partial^2 u}{partial x^2} + \frac{partial^2 u}{partial y^2} = 0 $ is a PDE. The key distinction lies in the number of independent variables: ODEs have one, while PDEs have two or more.",
        reasoning: "This answer is correct because it clearly distinguishes ODEs and PDEs based on the number of independent variables and provides accurate examples from the source material. The explanation aligns with the definitions given in Section 9.2.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Describe how to determine the order and degree of a differential equation, and explain why the degree may not always be defined.",
        correct_answer: "The order of a differential equation is the highest derivative present in the equation. For example, $ \frac{d^3y}{dx^3} + x\frac{d^2y}{dx^2} = 0 $ has order 3. The degree is the highest power of the highest-order derivative, provided the equation is a polynomial in its derivatives. For instance, $ left(\frac{d^2y}{dx^2}\right)^2 + \frac{dy}{dx} = 0 $ has degree 2. However, if the equation includes non-polynomial terms (e.g., $ sinleft(\frac{d^2y}{dx^2}\right) $), the degree is undefined because it cannot be expressed as a polynomial in derivatives.",
        reasoning: "This answer is accurate because it correctly defines order and degree using examples from the source material (Section 9.2.1 and 9.2.2) and explains the condition under which degree is undefined, as highlighted in the discussion of Equation 11.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Compare and contrast general and particular solutions of a differential equation, and explain how arbitrary constants relate to these solutions.",
        correct_answer: "A general solution contains arbitrary constants equal to the order of the differential equation, representing a family of solutions. For example, $ y = asin(x + b) $ is the general solution to $ \frac{d^2y}{dx^2} + y = 0 $, with constants $ a $ and $ b $. A particular solution is derived by assigning specific values to these constants, often determined by initial conditions. For instance, setting $ a = 2 $ and $ b = \frac{pi}{4} $ in the general solution yields a particular solution $ y = 2sinleft(x + \frac{pi}{4}\right) $. Arbitrary constants distinguish general solutions, while their absence defines particular solutions.",
        reasoning: "This answer is correct because it aligns with the definitions in Section 9.3, which explicitly contrasts general and particular solutions and their relationship to arbitrary constants. The examples provided are directly from the source material.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Describe the step-by-step process for solving a first-order homogeneous differential equation of the form $ \frac{dy}{dx} = gleft(\frac{y}{x}\right) $, and explain why the substitution $ y = vx $ is effective.",
        correct_answer: "The process involves: 1. Verifying the equation is homogeneous by expressing it as $ \frac{dy}{dx} = gleft(\frac{y}{x}\right) $. 2. Substituting $ y = vx $, which implies $ \frac{dy}{dx} = v + x\frac{dv}{dx} $. 3. Substituting into the original equation transforms it into $ v + x\frac{dv}{dx} = g(v) $, which simplifies to a separable equation in $ v $ and $ x $. 4. Solving this separable equation and substituting back $ v = \frac{y}{x} $ yields the solution. The substitution works because it reduces the equation to variables that can be separated, leveraging the homogeneity of $ gleft(\frac{y}{x}\right) $.",
        reasoning: "This answer is correct because it follows the method outlined in Section 9.4.2, including the substitution $ y = vx $, the resulting separable equation, and the rationale for the substitution. The explanation matches the source material's approach to solving homogeneous DEs.",
    },
    {
        topic: "Integrating Factor for Linear Differential Equations",
        question: "Explain the significance of the integrating factor in solving first-order linear differential equations of the form $ \frac{dy}{dx} + P(x)y = Q(x) $, and describe how it is derived.",
        correct_answer: "The integrating factor (I.F.) is a function $ e^{int P(x)dx} $ that, when multiplied through the differential equation, transforms the left-hand side into the derivative of a product $ \frac{d}{dx}[y cdot \text{I.F.}] $. This allows direct integration to find the solution. It is derived by ensuring the left-hand side becomes a perfect derivative: multiplying by $ \text{I.F.} = e^{int P(x)dx} $ satisfies the condition $ \frac{d}{dx}[y cdot \text{I.F.}] = Q(x) cdot \text{I.F.} $. The solution is then $ y = \text{I.F.}^{-1} int Q(x) cdot \text{I.F.} , dx + C $.",
        reasoning: "This answer is correct because it accurately describes the role and derivation of the integrating factor as detailed in Section 9.4.3. The explanation aligns with the mathematical steps provided in the source material, including the transformation into a perfect derivative and subsequent integration.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Explain the concept of order and degree in differential equations, and why the degree might not always be defined.",
        correct_answer: "The order of a differential equation is the highest order of the derivative present in the equation. For example, if the equation contains a second derivative (d²y/dx²), its order is two. The degree is the power of the highest-order derivative, provided the equation is a polynomial in its derivatives. However, if the equation includes non-polynomial terms (e.g., sine, exponential, or absolute value of derivatives), the degree cannot be defined. For instance, the equation d³y/dx³ + sin(d²y/dx²) = 0 has an undefined degree because the second derivative is inside a sine function, violating the polynomial requirement.",
        reasoning: "This answer is correct because it aligns with the source material's definitions of order and degree. It clarifies the polynomial condition for degree and provides an example (e.g., sine of a derivative) where the degree is undefined, as discussed in the text.",
    },
    {
        topic: "General vs. Particular Solutions",
        question: "Compare and contrast general and particular solutions of a differential equation, including their mathematical forms and physical interpretations.",
        correct_answer: "A general solution contains arbitrary constants equal to the order of the differential equation, representing an infinite family of solutions. For example, y = a sin(x + b) is the general solution to d²y/dx² + y = 0, with constants a and b. A particular solution is derived by assigning specific values to these constants, often determined by initial or boundary conditions. For instance, setting a = 2 and b = π/4 in the general solution yields a unique curve y = 2 sin(x + π/4), which satisfies specific physical constraints. The general solution reflects the system's inherent flexibility, while the particular solution models a specific scenario.",
        reasoning: "This answer is accurate because it distinguishes general and particular solutions using examples from the source material (e.g., y = a sin(x + b)) and explains their mathematical and physical significance, as outlined in the chapter on general and particular solutions.",
    },
    {
        topic: "Solving Linear Differential Equations",
        question: "Describe the step-by-step process for solving a first-order linear differential equation using an integrating factor.",
        correct_answer: "To solve a linear differential equation of the form dy/dx + P(x)y = Q(x), follow these steps: 1. Identify P(x) and Q(x). 2. Compute the integrating factor (I.F.) as e^(∫P(x)dx). 3. Multiply both sides of the equation by the I.F., transforming the left-hand side into the derivative of y·I.F. 4. Integrate both sides with respect to x. 5. Solve for y to obtain the general solution. For example, solving dy/dx - y = cos(x) involves an I.F. of e^(-x), leading to the solution y = (sin(x) - cos(x))/2 + Ce^x. This method ensures the equation becomes integrable after applying the I.F.",
        reasoning: "This answer is correct because it outlines the standard procedure for solving linear DEs using an integrating factor, as detailed in the source material, including the role of the I.F. and an example from the text (e.g., dy/dx - y = cos(x)).",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "What is the significance of the homogeneous property in differential equations, and how does it influence the substitution method for solving them?",
        correct_answer: "A homogeneous differential equation has the form dy/dx = F(y/x), where F is a function of the ratio y/x. This property allows the substitution y = vx (where v is a function of x), simplifying the equation into separable variables. For example, dy/dx = (x + y)/x becomes dv/dx = 1/v after substitution, enabling integration. The homogeneous property ensures the equation's structure is scale-invariant, meaning scaling x and y by λ does not change the equation's form. This substitution reduces the DE to a separable type, making it solvable through integration of v and x terms.",
        reasoning: "This answer is accurate because it explains the homogeneous property's role in enabling the y = vx substitution, as described in the source material, and provides an example (dy/dx = (x + y)/x) to illustrate the transformation into separable variables.",
    },
    {
        topic: "Verification of Solutions",
        question: "Explain how to verify whether a given function is a solution to a specific differential equation, using the concept of substitution and differentiation.",
        correct_answer: "To verify a solution, substitute the function and its derivatives into the differential equation and check if both sides are equal. For example, to verify y = e^(-3x) solves d²y/dx² + dy/dx - 6y = 0, compute dy/dx = -3e^(-3x) and d²y/dx² = 9e^(-3x). Substituting these into the equation yields 9e^(-3x) - 3e^(-3x) - 6e^(-3x) = 0, which simplifies to 0 = 0. This confirms the function satisfies the DE for all x in its domain, demonstrating the necessity of explicit differentiation and substitution.",
        reasoning: "This answer is correct because it follows the source material's method for verifying solutions, using explicit differentiation and substitution, as shown in Example 2 of the chapter on general and particular solutions.",
    },
    {
        topic: "Definition of Differential Equations",
        question: "Explain the concept of a differential equation and how it fundamentally differs from an algebraic equation.",
        correct_answer: "A differential equation is an equation that involves derivatives of a dependent variable with respect to one or more independent variables. Unlike algebraic equations, which relate variables through arithmetic operations and equality without involving derivatives, differential equations describe relationships between functions and their rates of change. For example, dy/dx = g(x) is a differential equation, whereas x² - 3x + 3 = 0 is an algebraic equation. The presence of terms like dy/dx (representing the derivative of y with respect to x) distinguishes differential equations and allows them to model dynamic systems where change is a key factor.",
        reasoning: "This answer is correct because it aligns with the source material's definition of differential equations as equations involving derivatives, contrasting them with algebraic equations that lack such terms. The example dy/dx = g(x) directly references the text, and the emphasis on modeling dynamic systems reflects the real-world applications mentioned in the introduction.",
    },
    {
        topic: "Types of Differential Equations",
        question: "Compare and contrast ordinary differential equations (ODEs) and partial differential equations (PDEs), using examples from the text.",
        correct_answer: "Ordinary differential equations (ODEs) involve derivatives of a dependent variable with respect to a single independent variable, such as 2(d²y/dx²) + (dy/dx)³ = 0, which contains only derivatives with respect to x. Partial differential equations (PDEs), not explicitly solved in the text, involve derivatives with respect to multiple independent variables. For instance, a PDE might include ∂²u/∂x² and ∂²u/∂y² terms. The key distinction lies in the number of independent variables: ODEs model systems with one variable (e.g., time), while PDEs handle multivariable systems (e.g., heat distribution in space).",
        reasoning: "This answer is accurate because it reflects the source's definition of ODEs (e.g., equation 5) and acknowledges PDEs, which are mentioned but not elaborated. The contrast between single-variable and multivariable derivatives aligns with the text's note that ODEs are the focus of study here.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Describe the step-by-step process for determining the order and degree of a differential equation, using specific examples from the text.",
        correct_answer: "To determine the order and degree of a differential equation: 1. Identify the highest-order derivative present (e.g., d²y/dx² in equation 7). This defines the order. 2. If the equation is a polynomial in its derivatives, the degree is the highest power of the highest-order derivative. For example, equation 6 (dy/dx = eˣ) has order 1 and degree 1, while equation 10 [(dy/dx)² + (dy/dx) - sin²y = 0] has order 1 and degree 2. However, equation 11 (dy/dx + sin(dy/dx) = 0) has an undefined degree because it is not a polynomial in dy/dx.",
        reasoning: "This answer is correct as it follows the source's methodology for determining order and degree. Examples like equations 6, 7, 10, and 11 from the text are explicitly referenced, and the explanation of undefined degree matches the text's discussion of non-polynomial equations.",
    },
    {
        topic: "General and Particular Solutions",
        question: "What is the significance of the order of a differential equation in determining the number of arbitrary constants in its general solution?",
        correct_answer: "The order of a differential equation determines the number of arbitrary constants in its general solution. For example, a second-order differential equation like d²y/dx² + y = 0 requires two arbitrary constants (e.g., y = a sin(x + b) in equation 4) to account for the integration steps needed to solve it. Each integration introduces a constant, and the number of integrations equals the order. Particular solutions eliminate these constants by applying initial or boundary conditions, as seen in equations 5 and 11 of the text.",
        reasoning: "This answer is accurate because it directly references the source's explanation that the general solution of an nth-order differential equation contains n arbitrary constants. The example of equation 4 (y = a sin(x + b)) and the discussion of particular solutions in the text support this reasoning.",
    },
    {
        topic: "Degree of Differential Equations",
        question: "Explain why the degree of a differential equation might not be defined, using specific examples from the text.",
        correct_answer: "The degree of a differential equation is undefined if the equation is not a polynomial in its derivatives. For instance, equation 11 (dy/dx + sin(dy/dx) = 0) cannot be expressed as a polynomial in dy/dx due to the sin(dy/dx) term, making its degree undefined. Similarly, equations like d²y/dx² + sin(y) = 0 (not a polynomial in y) have defined degree only if the highest-order derivative's power is a positive integer. The text explicitly states that degree applies only to polynomial equations in derivatives, as seen in equations 9-11.",
        reasoning: "This answer is correct because it cites the source's definition of degree as applicable only to polynomial equations in derivatives. Equation 11 is explicitly mentioned as a case with an undefined degree, and the reasoning aligns with the text's emphasis on polynomial structure for degree determination.",
    },
    {
        topic: "Definition of Differential Equations",
        question: "Explain the concept of a differential equation and how it fundamentally differs from an algebraic equation.",
        correct_answer: "A differential equation is an equation that involves derivatives of a dependent variable with respect to one or more independent variables. Unlike algebraic equations, which relate variables directly through arithmetic operations (e.g., $x^2 - 3x + 3 = 0$), differential equations incorporate rates of change (derivatives) of the dependent variable. For example, the equation $x \frac{dy}{dx} + y = 0$ includes the derivative $\frac{dy}{dx}$, making it a differential equation, whereas equations like $x^2 + y = 7$ involve only variables. This distinction highlights that differential equations model dynamic systems where change is inherent, such as in physics or biology, rather than static relationships.",
        reasoning: "This answer is correct because it aligns with the source's definition of differential equations as involving derivatives (e.g., equation 4) and contrasts them with algebraic equations (e.g., equations 3). The explanation reflects the source's emphasis on derivatives as central to differential equations.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Compare and contrast the concepts of order and degree in differential equations, providing examples where each is determined.",
        correct_answer: "The order of a differential equation is the highest derivative present, while the degree is the power of the highest-order derivative when the equation is a polynomial in derivatives. For example, $\frac{d^2y}{dx^2} + y = 0$ has order 2 and degree 1, as the highest derivative is squared to the first power. In contrast, $left(\frac{d^3y}{dx^3}\right) + x^2left(\frac{d^2y}{dx^2}\right)^3 = 0$ has order 3 and degree 1 (since the highest derivative is linear). However, $\frac{dy}{dx} + sinleft(\frac{dy}{dx}\right) = 0$ has no defined degree because it is not a polynomial in derivatives. These concepts are explicitly defined in the source material.",
        reasoning: "This answer is accurate because it directly references the source's definitions of order (highest derivative) and degree (polynomial power of the highest derivative), using examples like equations (6)-(9) and (11) from the text.",
    },
    {
        topic: "Verification of Solutions",
        question: "Describe the step-by-step process for verifying whether a given function is a solution to a differential equation.",
        correct_answer: "To verify a solution, substitute the function and its derivatives into the differential equation and check if both sides are equal. For example, to verify $y = e^{-3x}$ as a solution to $\frac{d^2y}{dx^2} + \frac{dy}{dx} - 6y = 0$, first compute $y' = -3e^{-3x}$ and $y'' = 9e^{-3x}$. Substituting these into the equation yields $9e^{-3x} + (-3e^{-3x}) - 6e^{-3x} = 0$, which simplifies to $0 = 0$, confirming the solution. This process ensures the function satisfies the equation identically, as demonstrated in Examples 2 and 3 of the source.",
        reasoning: "This answer is correct because it mirrors the verification steps outlined in the source, such as differentiating the proposed solution and substituting into the DE to confirm equality (e.g., Example 2).",
    },
    {
        topic: "General vs. Particular Solutions",
        question: "What is the significance of arbitrary constants in the general solution of a differential equation, and how does this differ from a particular solution?",
        correct_answer: "Arbitrary constants in a general solution represent the family of all possible solutions to a differential equation. For instance, $y = a sin(x + b)$ is the general solution to $\frac{d^2y}{dx^2} + y = 0$, with constants $a$ and $b$ accounting for infinitely many curves. A particular solution, like $y = 2sinleft(x + \frac{pi}{4}\right)$, eliminates these constants by applying specific initial conditions (e.g., $a = 2, b = \frac{pi}{4}$). The general solution reflects the system's inherent flexibility, while a particular solution is uniquely determined by constraints, as explained in the source's discussion of general and particular solutions.",
        reasoning: "This answer is accurate because it reflects the source's distinction between general solutions (with arbitrary constants) and particular solutions (with constants replaced by specific values), using the examples provided in the text.",
    },
    {
        topic: "Classification of Differential Equations",
        question: "Explain the difference between ordinary differential equations (ODEs) and partial differential equations (PDEs), and provide an example of each from the source material.",
        correct_answer: "Ordinary differential equations (ODEs) involve derivatives with respect to a single independent variable, while partial differential equations (PDEs) involve derivatives with respect to multiple independent variables. For example, $2\frac{d^2y}{dx^2} + left(\frac{dy}{dx}\right)^3 = 0$ is an ODE because it contains derivatives with respect to $x$ only. In contrast, a PDE like the heat equation $\frac{partial u}{partial t} = k\frac{partial^2 u}{partial x^2}$ involves partial derivatives with respect to both $t$ and $x$. The source explicitly defines ODEs (e.g., equation 5) and notes that PDEs are beyond its scope, confirming this distinction.",
        reasoning: "This answer is correct because it aligns with the source's definition of ODEs (e.g., equation 5) and its mention of PDEs as involving multiple variables, even though PDEs are not elaborated further in the text.",
    },
    {
        topic: "Ordinary vs. Partial Differential Equations",
        question: "Compare and contrast ordinary differential equations (ODEs) and partial differential equations (PDEs), including their defining characteristics.",
        correct_answer: "Ordinary differential equations (ODEs) involve derivatives of a dependent variable with respect to a single independent variable, such as dy/dx or d²y/dx². For example, 2(d²y/dx²) + (dy/dx)³ = 0 is an ODE. In contrast, partial differential equations (PDEs) involve partial derivatives with respect to multiple independent variables, such as ∂u/∂t = k(∂²u/∂x²). ODEs describe systems with one independent variable (e.g., time), while PDEs model phenomena dependent on multiple variables (e.g., heat distribution in space and time). The source material emphasizes that ODEs are the focus of the chapter, while PDEs are mentioned as a broader category requiring multiple variables.",
        reasoning: "This answer is correct because it aligns with the source's definition of ODEs as equations involving derivatives with respect to one variable and PDEs as involving multiple variables. The examples and contextual applications (e.g., time vs. space-time) reflect the material's emphasis on distinguishing these two types.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Explain the concept of the order of a differential equation and how it is determined from its mathematical form.",
        correct_answer: "The order of a differential equation is defined as the order of the highest derivative of the dependent variable with respect to the independent variable present in the equation. For instance, in the equation (d³y/dx³) + x²(d²y/dx²)³ = 0, the highest derivative is the third-order term d³y/dx³, so the order is 3. The source material explicitly states that order is always a positive integer and provides examples like dy/dx = eˣ (order 1) and d²y/dx² + y = 0 (order 2) to illustrate this principle.",
        reasoning: "This answer is factually accurate as it directly references the source's definition of order and uses examples from the text (e.g., equations with orders 1, 2, and 3) to clarify the determination process.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Describe the conditions under which the degree of a differential equation is defined and explain how it is determined.",
        correct_answer: "The degree of a differential equation is defined only if the equation is a polynomial in its derivatives. It is the highest power of the highest-order derivative after the equation is expressed in polynomial form. For example, the equation (d²y/dx²)² + (dy/dx)³ = 0 has degree 2 because the highest-order derivative (d²y/dx²) is squared. However, equations like dy/dx + sin(dy/dx) = 0 are not polynomials in derivatives, so their degree is undefined. The source material emphasizes that degree is a positive integer when defined and provides examples like (d³y/dx³) + y² + e^(dy/dx) = 0, where the degree is undefined due to the exponential term.",
        reasoning: "This answer correctly reflects the source's criteria for defining degree (polynomial form) and uses examples from the text, such as equations with defined and undefined degrees, to validate the explanation.",
    },
    {
        topic: "General vs. Particular Solutions",
        question: "Compare general and particular solutions of a differential equation, including the role of arbitrary constants.",
        correct_answer: "A general solution contains arbitrary constants equal to the order of the differential equation, representing a family of solutions. For example, y = a sin(x + b) is the general solution to d²y/dx² + y = 0, with constants a and b. A particular solution is derived by assigning specific values to these constants based on initial or boundary conditions. For instance, substituting a = 2 and b = π/4 into the general solution yields y = 2 sin(x + π/4), a particular solution. The source material explicitly defines general solutions as containing arbitrary constants and particular solutions as free from them, obtained by fixing these constants.",
        reasoning: "This answer is accurate because it mirrors the source's distinction between general and particular solutions, using the provided example with arbitrary constants and their elimination to satisfy specific conditions.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Explain the significance of homogeneous differential equations and describe the substitution method used to solve them.",
        correct_answer: "A homogeneous differential equation is one where the function F(x, y) satisfies F(λx, λy) = λⁿF(x, y) for some degree n. For first-order equations, this allows substitution like y = vx (or x = vy) to transform the equation into a separable form. For example, dy/dx = (x + 2y)/(x - y) is homogeneous of degree 0. Substituting y = vx reduces it to v + x(dv/dx) = (1 + 2v)/(1 - v), which can be solved by separating variables. The source material details this substitution process and provides worked examples, such as solving (x - y)dy = (x + y)dx using y = vx.",
        reasoning: "This answer is correct as it aligns with the source's definition of homogeneous functions, the substitution method (y = vx), and the transformation into a separable equation, all of which are demonstrated in the text's examples.",
    },
    {
        topic: "Ordinary vs. Partial Differential Equations",
        question: "Compare and contrast ordinary differential equations (ODEs) and partial differential equations (PDEs), providing examples from the source material.",
        correct_answer: "Ordinary differential equations (ODEs) involve derivatives of a dependent variable with respect to a single independent variable, such as $ \frac{d^2y}{dx^2} + y = 0 $, which is an ODE of order 2. Partial differential equations (PDEs) involve derivatives with respect to multiple independent variables, such as the heat equation $ \frac{partial u}{partial t} = k \frac{partial^2 u}{partial x^2} $. The key distinction lies in the number of independent variables: ODEs have one, while PDEs have two or more. The source material explicitly states that this chapter focuses on ODEs, emphasizing their simpler structure compared to PDEs.",
        reasoning: "This answer is correct because it aligns with the source's definition of ODEs and PDEs, provides examples from the text (e.g., $ \frac{d^2y}{dx^2} + y = 0 $), and highlights the critical difference in the number of independent variables.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Explain the significance of the order and degree of a differential equation, and under what conditions the degree is undefined.",
        correct_answer: "The order of a differential equation is the highest derivative present, such as order 3 for $ left(\frac{d^3y}{dx^3}\right) + x^2left(\frac{d^2y}{dx^2}\right)^3 = 0 $. The degree is the highest power of the highest-order derivative when the equation is a polynomial in its derivatives. For example, $ \frac{d^2y}{dx^2} + y = 0 $ has degree 1. However, if the equation includes non-polynomial terms (e.g., $ \frac{dy}{dx} + sinleft(\frac{dy}{dx}\right) = 0 $), the degree is undefined. The source explicitly states that degree is only defined for polynomial equations in derivatives.",
        reasoning: "This answer is correct because it references the source's definitions of order and degree, provides examples (e.g., $ \frac{d^2y}{dx^2} + y = 0 $), and explains the condition for undefined degree (non-polynomial terms).",
    },
    {
        topic: "General and Particular Solutions",
        question: "Describe the step-by-step process for obtaining a particular solution from a general solution of a differential equation, using an example from the source material.",
        correct_answer: "The process involves two steps: 1. Solve the differential equation to find the general solution, which includes arbitrary constants. For example, $ y = a sin(x + b) $ is the general solution of $ \frac{d^2y}{dx^2} + y = 0 $. 2. Apply initial or boundary conditions to determine the constants. For instance, substituting $ y = 1 $ when $ x = 0 $ in $ y = ae^{-3x} $ yields $ a = 1 $, resulting in the particular solution $ y = e^{-3x} $. The source illustrates this with examples like Example 2, where initial conditions eliminate constants.",
        reasoning: "This answer is correct because it follows the source's explanation of general and particular solutions, uses the example $ y = a sin(x + b) $, and references Example 2 for the substitution of initial conditions.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Compare the concepts of a homogeneous function and a homogeneous differential equation, and explain how the substitution $ y = vx $ simplifies the solution process.",
        correct_answer: "A homogeneous function $ F(x, y) $ satisfies $ F(lambda x, lambda y) = lambda^n F(x, y) $, such as $ F(x, y) = x^2 + xy $. A homogeneous differential equation is of the form $ \frac{dy}{dx} = gleft(\frac{y}{x}\right) $, where $ g $ is a homogeneous function of degree 0. The substitution $ y = vx $ transforms the equation into $ v + x\frac{dv}{dx} = g(v) $, separating variables $ v $ and $ x $. This method is demonstrated in Example 10, where the substitution reduces the equation to integrable terms.",
        reasoning: "This answer is correct because it aligns with the source's definition of homogeneous functions and differential equations, explains the substitution $ y = vx $, and references Example 10 for the transformation process.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Explain the method of integrating factors for solving first-order linear differential equations, including the role of the integrating factor (I.F.) in transforming the equation.",
        correct_answer: "For a first-order linear differential equation $ \frac{dy}{dx} + Py = Q $, the integrating factor (I.F.) is $ e^{int P dx} $. Multiplying both sides by the I.F. transforms the left-hand side into the derivative of $ y cdot \text{I.F.} $, enabling integration. For example, in Example 14, the I.F. $ e^{-x} $ converts $ \frac{dy}{dx} - y = cos x $ into $ \frac{d}{dx}(y e^{-x}) = e^{-x} cos x $, which is solved by integrating both sides. The source emphasizes this method as a systematic approach for linear equations.",
        reasoning: "This answer is correct because it follows the source's explanation of integrating factors, provides the formula for I.F., and references Example 14 to illustrate the transformation and integration steps.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Explain the concept of the order of a differential equation, using examples from the provided source material.",
        correct_answer: "The order of a differential equation is defined as the order of the highest derivative of the dependent variable with respect to the independent variable involved in the equation. For instance, the equation $\\frac{dy}{dx} = e^x$ has an order of 1 because the highest derivative is the first derivative. Similarly, $\\frac{d^2y}{dx^2} + y = 0$ has an order of 2, as the second derivative is the highest, and $\\left(\\frac{d^3y}{dx^3}\\right) + x^2\\left(\\frac{d^2y}{dx^2}\\right)^3 = 0$ has an order of 3 due to the presence of the third derivative. These examples illustrate how the order is determined solely by the highest derivative, regardless of its power or other terms in the equation.",
        reasoning: "This answer is correct because it directly references the source material's definition of order and uses the examples provided (equations 6, 7, and 8) to demonstrate the concept. The explanation aligns with the text's emphasis on identifying the highest derivative to determine the order.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Compare and contrast the concepts of order and degree in differential equations, as defined in the source material.",
        correct_answer: "The order of a differential equation refers to the highest derivative present, while the degree is the power to which that highest derivative is raised, provided the equation is a polynomial in its derivatives. For example, $\\frac{d^2y}{dx^2} + y = 0$ has order 2 and degree 1, as the second derivative is raised to the first power. In contrast, $\\left(\\frac{d^3y}{dx^3}\\right)^2 + \\frac{dy}{dx} = 0$ has order 3 and degree 2. However, equations like $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ lack a defined degree because they are not polynomial in derivatives, even though their order is 1. This distinction highlights that order is always defined, but degree is only applicable to polynomial equations in derivatives.",
        reasoning: "This answer is accurate because it correctly differentiates between order and degree using definitions and examples from the source. It references the requirement for the equation to be polynomial in derivatives for the degree to be defined, as emphasized in the text.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Describe the step-by-step process for determining the order of a differential equation, referencing the examples provided in the source material.",
        correct_answer: "To determine the order of a differential equation, follow these steps: 1. Identify all derivatives present in the equation. 2. Locate the highest-order derivative (e.g., $\\frac{dy}{dx}$, $\\frac{d^2y}{dx^2}$, etc.). 3. The order is the number corresponding to the highest derivative. For example, in $\\frac{dy}{dx} - \\cos x = 0$, the highest derivative is $\\frac{dy}{dx}$ (first order). In $x\\frac{d^2y}{dx^2} + x\\left(\\frac{dy}{dx}\\right)^2 - y\\frac{dy}{dx} = 0$, the highest derivative is $\\frac{d^2y}{dx^2}$ (second order). Similarly, $y''' + y^2 + e^{y'} = 0$ has order 3 due to $y'''$. The examples from the source material confirm that the order depends solely on the highest derivative, not its power or other terms.",
        reasoning: "This answer is correct because it outlines a clear, step-by-step method for determining order, as implied by the source material's examples. It references specific equations (e.g., Example 1) to illustrate the process, aligning with the text's approach.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "What is the significance of knowing the order of a differential equation when solving it, based on the material provided?",
        correct_answer: "Knowing the order of a differential equation is significant because it determines the number of initial conditions required to find a particular solution and influences the solution method. For example, first-order equations (order 1) typically require one initial condition and can often be solved using separation of variables or integrating factors, as discussed in Section 9.4. Second-order equations (order 2) generally need two initial conditions and may involve methods like solving characteristic equations, though the source material does not delve into higher-order techniques. The order also reflects the complexity of the equation, as higher-order equations often describe more intricate physical phenomena, such as oscillations in mechanical systems. This aligns with the text's emphasis on general solutions containing arbitrary constants equal to the order of the equation.",
        reasoning: "This answer is valid because it connects the concept of order to practical aspects of solving differential equations, such as the number of initial conditions and solution methods, as discussed in the source. It also references the general solution's relationship to the order (e.g., two constants for second-order equations), as seen in Examples 2 and 3.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "How does the order of a differential equation affect the general solution, according to the provided material?",
        correct_answer: "The order of a differential equation directly determines the number of arbitrary constants in its general solution. For instance, a first-order equation (order 1) will have one arbitrary constant, as seen in $y = a\\sin(x + b)$, where $a$ is the constant. A second-order equation (order 2) will have two arbitrary constants, such as in the general solution of $\\frac{d^2y}{dx^2} + y = 0$, which includes both $a$ and $b$. This pattern continues for higher orders, with the general solution containing as many arbitrary constants as the order of the equation. The source material explicitly states that the general solution contains constants equal to the order, as demonstrated in Examples 2 and 3, where the number of constants matches the equation's order.",
        reasoning: "This answer is correct because it accurately links the order of a differential equation to the number of arbitrary constants in its general solution, as explained in the source material. It references specific examples (e.g., Example 2) and aligns with the text's discussion of general and particular solutions.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Explain the concept of the order of a differential equation and provide examples to illustrate how it is determined.",
        correct_answer: "The order of a differential equation is defined as the order of the highest derivative of the dependent variable with respect to the independent variable present in the equation. For example, the equation dy/dx = e^x involves a first-order derivative (y'), so its order is 1. Similarly, d²y/dx² + y = 0 contains a second-order derivative (y''), making its order 2. A third-order example is (d³y/dx³) + x²(d²y/dx²)^3 = 0, where the highest derivative is y''', giving an order of 3. The order is always a positive integer, as emphasized in the source material.",
        reasoning: "This answer correctly defines the order using the source's definition and aligns with the examples provided (equations 6, 7, and 8 in the text), which explicitly demonstrate how the order corresponds to the highest derivative present.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Compare and contrast the concepts of 'order' and 'degree' in differential equations, including when the degree is defined.",
        correct_answer: "The order of a differential equation refers to the highest derivative present, while the degree is the power of that highest derivative when the equation is a polynomial in its derivatives. For instance, in the equation d³y/dx³ + 2(d²y/dx²)^2 - dy/dx + y = 0, the order is 3 (due to y''') and the degree is 1 (since y''' is raised to the first power). However, degree is undefined for non-polynomial equations like dy/dx + sin(dy/dx) = 0, as the derivative term is inside a sine function. Both concepts are positive integers when defined, but order is always defined, whereas degree is not.",
        reasoning: "This answer accurately distinguishes between order and degree using the source's definitions and examples (equations 9-11), highlighting when degree is defined and contrasting it with the always-defined order.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Describe the step-by-step process for determining the order of a given differential equation.",
        correct_answer: "To determine the order: 1. Identify all derivatives present in the equation (e.g., dy/dx, d²y/dx²). 2. Locate the highest-order derivative (e.g., d³y/dx³ in equation 8). 3. Confirm that the order is the numerical value of this highest derivative (e.g., 3 for d³y/dx³). For example, in x(d²y/dx²) + y(dy/dx) - y = 0, the highest derivative is d²y/dx², so the order is 2. The process does not depend on the degree or complexity of the equation, only on the highest derivative's order.",
        reasoning: "This answer follows the source's methodology, as seen in the examples of equations 6-8, where the order is determined solely by the highest derivative's order, regardless of other terms.",
    },
    {
        topic: "Order of a Differential Equation",
        question: "What is the significance of knowing the order of a differential equation in the context of solving it?",
        correct_answer: "Knowing the order is crucial because it indicates the number of initial conditions required to find a particular solution. For example, a first-order equation like dy/dx = e^x needs one initial condition (e.g., y(0) = 1), while a second-order equation like d²y/dx² + y = 0 requires two (e.g., y(0) = a and y'(0) = b). The order also guides the choice of solution methods, such as separation of variables for first-order equations or characteristic equations for higher-order linear equations, as discussed in the chapter's overview of solution strategies.",
        reasoning: "This answer correctly links the order to the number of initial conditions and solution methods, reflecting the source's emphasis on the importance of order in classifying and solving differential equations (e.g., in sections 9.3 and 9.4).",
    },
    {
        topic: "Order of a Differential Equation",
        question: "Given the differential equation y''' + y² + e^{y'} = 0, explain how to determine its order and why its degree is undefined.",
        correct_answer: "The order of the equation y''' + y² + e^{y'} = 0 is 3 because the highest derivative present is the third-order term y''' (d³y/dx³). However, the degree is undefined because the equation is not a polynomial in its derivatives. Specifically, the term e^{y'} involves the first derivative y' inside an exponential function, which cannot be expressed as a finite polynomial in y', y'', y''', etc. This aligns with the source's explanation that degree is only defined for polynomial equations in derivatives (e.g., equation 11 in the text).",
        reasoning: "This answer correctly applies the source's definitions of order and degree, referencing the requirement for polynomial form to define degree and using the example from the text (equation 11) as a parallel.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Explain the concept of the degree of a differential equation and why it is only defined for equations that are polynomial in their derivatives.",
        correct_answer: "The degree of a differential equation is the highest power (positive integer) of the highest-order derivative present in the equation, provided the equation is a polynomial in its derivatives. For example, equations like $\\frac{d^3 y}{dx^3} + 2(\\frac{d^2 y}{dx^2})^2 - \\frac{dy}{dx} + y = 0$ (degree 1) and $(\\frac{dy}{dx})^2 + \\frac{dy}{dx} - \\sin^2 y = 0$ (degree 2) are polynomials in their derivatives. However, equations like $\\frac{dy}{dx} + \\sin(\\frac{dy}{dx}) = 0$ are not polynomials in derivatives due to the $\\sin(\\frac{dy}{dx})$ term, making their degree undefined. This restriction ensures the degree is a well-defined integer, as non-polynomial terms cannot be expressed as finite powers.",
        reasoning: "This answer is correct because it aligns with the source material, which explicitly states that the degree is defined only for polynomial equations in derivatives. The examples and reasoning directly reference the text's explanation of polynomial vs. non-polynomial forms.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Compare and contrast the degree of the differential equations $\\left(\\frac{d^2 y}{dx^2}\\right)^3 + x\\left(\\frac{dy}{dx}\\right)^4 = 0$ and $\\frac{d^2 y}{dx^2} + \\cos\\left(\\frac{dy}{dx}\\right) = 0$, explaining why one has a defined degree and the other does not.",
        correct_answer: "The equation $\\left(\\frac{d^2 y}{dx^2}\\right)^3 + x\\left(\\frac{dy}{dx}\\right)^4 = 0$ has a degree of 3 because it is a polynomial in its derivatives, with the highest-order derivative $\\frac{d^2 y}{dx^2}$ raised to the power of 3. In contrast, the equation $\\frac{d^2 y}{dx^2} + \\cos\\left(\\frac{dy}{dx}\\right) = 0$ does not have a defined degree because the term $\\cos\\left(\\frac{dy}{dx}\\right)$ is non-polynomial. The degree depends on the equation being expressible as a polynomial in derivatives, which is true for the first equation but not the second.",
        reasoning: "This answer is accurate because it correctly applies the source's definition of degree to both equations. The first equation satisfies the polynomial requirement, while the second fails due to the cosine term, as explained in the text.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Describe the step-by-step process for determining the degree of a differential equation, including how to verify if the degree is defined.",
        correct_answer: "To determine the degree of a differential equation: 1. Identify the highest-order derivative in the equation. 2. Check if the equation is a polynomial in all its derivatives (e.g., terms like $\\frac{d^2 y}{dx^2}$, $\\frac{dy}{dx}$) with non-negative integer exponents. 3. If it is a polynomial, the degree is the power of the highest-order derivative. For example, in $\\left(\\frac{d^3 y}{dx^3}\\right)^2 + \\frac{dy}{dx} = 0$, the degree is 2. If the equation contains non-polynomial terms (e.g., $\\sin(\\frac{dy}{dx})$, $e^{\\frac{d^2 y}{dx^2}}$), the degree is undefined. This process ensures the degree is only assigned when the equation meets the polynomial criterion.",
        reasoning: "This answer is correct as it outlines the systematic approach from the source material, emphasizing the polynomial requirement and the role of the highest-order derivative's power in defining the degree.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "What is the significance of the degree of a differential equation in the context of solving such equations, and how does it differ from the role of the order?",
        correct_answer: "The degree of a differential equation indicates the complexity of the highest-order derivative's influence on the equation, which can affect solution methods. For instance, a first-degree equation (linear in the highest derivative) may be solvable via standard techniques like separation of variables or integrating factors, while higher-degree equations might require more specialized approaches. In contrast, the order determines the number of arbitrary constants in the general solution. While the order is always defined (as it depends only on the highest derivative), the degree may be undefined if the equation is non-polynomial in derivatives, highlighting their distinct roles in classification and solution strategies.",
        reasoning: "This answer is accurate because it reflects the source's emphasis on the degree's dependence on polynomial structure and its practical implications for solution methods, while contrasting it with the order's universal applicability.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Contrast the concepts of order and degree of a differential equation, providing examples where one is defined but the other is not.",
        correct_answer: "The order of a differential equation is the highest derivative present, always a positive integer, while the degree is the power of the highest derivative only if the equation is a polynomial in its derivatives. For example, $\\frac{d^2 y}{dx^2} + y = 0$ has order 2 and degree 1. However, $\\frac{d^2 y}{dx^2} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ has order 2 but undefined degree due to the non-polynomial sine term. Conversely, $\\left(\\frac{dy}{dx}\\right)^3 + y = 0$ has order 1 and degree 3. This contrast shows that order is universally defined, but degree depends on the equation's structure.",
        reasoning: "This answer is correct as it directly references the source's examples and definitions, clearly distinguishing between the universally defined order and the conditionally defined degree, supported by appropriate examples.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Explain the concept of the degree of a differential equation and under what conditions it is defined.",
        correct_answer: "The degree of a differential equation is defined as the highest power (positive integer) of the highest order derivative present in the equation, provided the equation is a polynomial in its derivatives. For example, equations like $\\frac{d^3 y}{dx^3} + 2\\left(\\frac{d^2 y}{dx^2}\\right)^2 - \\frac{dy}{dx} + y = 0$ (degree 1) and $\\left(\\frac{dy}{dx}\\right)^2 + \\frac{dy}{dx} - \\sin^2 y = 0$ (degree 2) are polynomials in derivatives, so their degrees are defined. However, equations like $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ are not polynomials in derivatives, so their degree is undefined.",
        reasoning: "This answer is correct because it aligns with the source material's definition of degree, emphasizing the polynomial requirement and citing specific examples (equations 9, 10, and 11) to illustrate cases where the degree is defined or undefined.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Compare and contrast the determination of order and degree of a differential equation, providing examples where they are defined and where they are not.",
        correct_answer: "The order of a differential equation is always defined as the highest derivative present, while the degree is only defined if the equation is a polynomial in its derivatives. For instance, $\\frac{d^2 y}{dx^2} + y = 0$ has order 2 and degree 1. In contrast, $\\left(\\frac{dy}{dx}\\right)^2 + \\frac{dy}{dx} - \\sin^2 y = 0$ has order 1 and degree 2. However, equations like $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ lack a defined degree because they are not polynomials in derivatives, even though their order is defined.",
        reasoning: "This answer is accurate because it distinguishes order (always defined) from degree (conditional on polynomial form), using examples from the source material (equations 7, 10, and 11) to highlight cases where degree is or isn't defined.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Describe the step-by-step process to determine the degree of a given differential equation, using an example of your choice.",
        correct_answer: "To determine the degree: 1. Verify the equation is a polynomial in derivatives (e.g., $y'$, $y''$). 2. Identify the highest order derivative (e.g., $y'''$ in $y''' + (y'')^2 + y = 0$). 3. Find the highest power of this derivative. For example, in $\\left(\\frac{d^3 y}{dx^3}\\right)^2 + \\left(\\frac{d^2 y}{dx^2}\\right)^3 = 0$, the highest order derivative is $y'''$ (third order), and its power is 2, so the degree is 2. If the equation isn't a polynomial (e.g., $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$), the degree is undefined.",
        reasoning: "This answer is correct as it outlines the procedural steps for determining degree, uses a constructed example matching the source's structure (equation 8), and explains non-polynomial cases like equation 11.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "What is the significance of a differential equation being a polynomial in its derivatives when determining its degree?",
        correct_answer: "The polynomial requirement ensures that the degree is a well-defined positive integer. For example, $\\left(\\frac{dy}{dx}\\right)^2 + \\frac{dy}{dx} - \\sin^2 y = 0$ is a polynomial in $y'$, so its degree (2) is meaningful. However, equations like $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ involve transcendental functions of derivatives, making their degree undefined. This distinction is critical because non-polynomial equations cannot be analyzed using algebraic methods tied to degree.",
        reasoning: "This answer is valid because it directly references the source's emphasis on polynomial form for degree definition, using equations 10 and 11 as examples, and explains the practical implications for analysis.",
    },
    {
        topic: "Degree of a Differential Equation",
        question: "Analyze why the degree of a differential equation cannot be defined for certain types of equations, with specific examples from the source material.",
        correct_answer: "The degree is undefined for equations that are not polynomials in their derivatives because their structure defies algebraic classification by power. For example, $\\frac{dy}{dx} + \\sin\\left(\\frac{dy}{dx}\\right) = 0$ (equation 11) involves a transcendental function of $y'$, making it impossible to assign a degree. Similarly, $\\frac{d^4 y}{dx^4} + \\sin\\left(y'''\\right) = 0$ (Exercise 9.1, Problem 1) contains a sine function of $y'''$, so its degree is undefined. These cases require alternative analytical methods beyond polynomial-based degree analysis.",
        reasoning: "This answer is accurate because it cites specific examples from the source (equation 11 and Exercise 1) and explains the mathematical reason (non-polynomial form) for undefined degrees, aligning with the text's discussion.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Explain the difference between a general solution and a particular solution of a differential equation, and describe how initial conditions are used to derive a particular solution from the general solution.",
        correct_answer: "A general solution of a differential equation contains arbitrary constants and represents an infinite family of solutions. For example, the function $ y = a sin(x + b) $, where $ a $ and $ b $ are arbitrary constants, is a general solution. A particular solution is obtained by assigning specific values to these constants based on initial or boundary conditions. For instance, if $ a = 2 $ and $ b = \frac{pi}{4} $, the solution $ y = 2 sin(x + \frac{pi}{4}) $ becomes a particular solution. Initial conditions, such as $ y = y_0 $ when $ x = x_0 $, are substituted into the general solution to solve for the constants, thereby narrowing the solution to a specific curve that satisfies both the differential equation and the given conditions.",
        reasoning: "This answer is correct because it aligns with the definitions provided in the source material. The general solution includes arbitrary constants (e.g., $ a $ and $ b $ in Example 3), while the particular solution eliminates these constants by applying initial conditions (e.g., Example 6, where $ y = 1 $ when $ x = 0 $ determines $ C = -1 $). The reasoning reflects the distinction emphasized in the text between general and particular solutions.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Describe the step-by-step process for verifying whether a given function is a solution to a specific differential equation.",
        correct_answer: "To verify if a function is a solution, follow these steps: 1. Compute the necessary derivatives of the given function. 2. Substitute the function and its derivatives into the differential equation. 3. Simplify both sides of the equation to check if they are equal. For example, to verify $ y = e^{-3x} $ as a solution to $ \frac{d^2y}{dx^2} + \frac{dy}{dx} - 6y = 0 $, calculate $ \frac{dy}{dx} = -3e^{-3x} $ and $ \frac{d^2y}{dx^2} = 9e^{-3x} $. Substituting these into the equation yields $ 9e^{-3x} + (-3e^{-3x}) - 6e^{-3x} = 0 $, which simplifies to $ 0 = 0 $, confirming the solution.",
        reasoning: "This answer is correct because it mirrors the verification process demonstrated in Examples 2 and 3 of the source material. The method involves substituting the function and its derivatives into the differential equation to confirm equality, as explicitly shown in the examples provided.",
    },
    {
        topic: "General and Particular Solutions",
        question: "What is the significance of arbitrary constants in the general solution of a differential equation, and how does their number relate to the order of the equation?",
        correct_answer: "Arbitrary constants in a general solution represent degrees of freedom in the solution family, corresponding to the number of independent conditions required to determine a unique particular solution. The number of arbitrary constants equals the order of the differential equation. For instance, a second-order differential equation like $ \frac{d^2y}{dx^2} + y = 0 $ has a general solution $ y = a cos x + b sin x $ with two constants ($ a $ and $ b $). This ensures the solution can accommodate initial conditions such as $ y(0) $ and $ y'(0) $, which are necessary to solve for the constants and obtain a particular solution.",
        reasoning: "This answer is correct because it reflects the source material's explanation that the number of arbitrary constants in the general solution matches the order of the differential equation (e.g., Exercise 9.2, Question 11 states that a fourth-order equation has four constants). The reasoning aligns with the examples provided, such as Example 3, where a second-order equation has two constants.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Compare and contrast the roles of general and particular solutions in modeling real-world phenomena, using examples from the source material.",
        correct_answer: "General solutions provide a framework for all possible behaviors of a system governed by a differential equation, while particular solutions describe specific instances under given initial or boundary conditions. For example, the general solution $ y = Ce^{-x} $ for $ \frac{dy}{dx} + y = 0 $ represents exponential decay for any constant $ C $. However, a particular solution like $ y = 5e^{-x} $ (with $ C = 5 $) models a specific scenario, such as the decay of a radioactive substance starting with an initial quantity of 5. Similarly, in Example 9, the general solution $ P = Ce^{t/20} $ models continuous compounding interest, but the particular solution $ P = 1000e^{t/20} $ applies when the principal is Rs 1000 at $ t = 0 $.",
        reasoning: "This answer is correct because it uses examples from the source (e.g., Example 2 for exponential decay and Example 9 for continuous compounding) to illustrate how general solutions encompass all possibilities, while particular solutions apply to specific cases. The reasoning aligns with the text's emphasis on the practical application of solutions.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Explain why a particular solution to a differential equation does not contain arbitrary constants, and discuss how such solutions are determined in practice.",
        correct_answer: "A particular solution does not contain arbitrary constants because it is derived by applying specific initial or boundary conditions to the general solution, which eliminates the constants. For example, in Example 6, the differential equation $ \frac{dy}{dx} = -4xy^2 $ has a general solution $ y = \frac{1}{2x^2 - C} $. When given the condition $ y = 1 $ at $ x = 0 $, substituting these values yields $ C = -1 $, resulting in the particular solution $ y = \frac{1}{2x^2 + 1} $. In practice, particular solutions are determined by solving algebraic equations formed by substituting known values (e.g., $ y(x_0) = y_0 $) into the general solution.",
        reasoning: "This answer is correct because it directly references the process described in the source material, such as Example 6, where initial conditions are used to solve for $ C $. The reasoning aligns with the text's explanation that particular solutions are obtained by eliminating arbitrary constants through substitution of known values.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Explain the difference between a general solution and a particular solution of a differential equation, and describe how a particular solution can be derived from the general solution.",
        correct_answer: "A general solution of a differential equation contains arbitrary constants and represents a family of solutions that satisfy the equation for all possible values of these constants. A particular solution is obtained by assigning specific values to these constants based on initial or boundary conditions. For example, if the general solution of a second-order differential equation is y = a sin(x + b), where a and b are arbitrary constants, a particular solution like y = 2 sin(x + π/4) is derived by substituting specific values (a=2, b=π/4) that satisfy given conditions, such as y(0) = √2.",
        reasoning: "This answer is correct because it aligns with the source material's distinction between general and particular solutions. The source explicitly states that the general solution includes arbitrary constants (e.g., a and b in y = a sin(x + b)) and that particular solutions are obtained by substituting specific values for these constants to meet initial conditions, as demonstrated in Example 2 and the surrounding text.",
    },
    {
        topic: "General and Particular Solutions",
        question: "What is the significance of arbitrary constants in the general solution of a differential equation, and how does their number relate to the order of the equation?",
        correct_answer: "Arbitrary constants in the general solution represent the degrees of freedom in the solution space, corresponding to the infinite number of curves that satisfy the differential equation. The number of arbitrary constants equals the order of the differential equation. For instance, a first-order equation has one constant (e.g., y = Ce^{-3x} in Example 2), while a second-order equation has two constants (e.g., y = a cos x + b sin x in Example 3). This ensures the general solution accounts for all possible solutions before applying specific constraints.",
        reasoning: "This answer is factually accurate as per the source material. The text explicitly states that the general solution contains arbitrary constants (e.g., 'the general solution of the differential equation (3) is y = a sin(x + b)') and links the number of constants to the equation's order. Exercise 9.2, Question 11 also confirms that a fourth-order equation has four arbitrary constants in its general solution.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Describe the step-by-step process for finding a particular solution of a differential equation when given initial conditions.",
        correct_answer: "The process involves three steps: 1. Solve the differential equation to obtain the general solution with arbitrary constants. 2. Substitute the initial conditions (e.g., y(x₀) = y₀, y'(x₀) = y₁) into the general solution. 3. Solve the resulting system of equations to determine the constants. For example, in Example 6, the general solution y = 1/(2x² - C) is derived, and the initial condition y(0) = 1 yields C = -1, leading to the particular solution y = 1/(2x² + 1).",
        reasoning: "This answer is correct because it mirrors the methodology outlined in the source. Examples like Example 6 and Example 7 explicitly demonstrate substituting initial conditions into the general solution to solve for constants. The source emphasizes that particular solutions are obtained by eliminating arbitrary constants through initial conditions.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Why are initial conditions necessary to determine a particular solution of a differential equation, and how do they ensure uniqueness?",
        correct_answer: "Initial conditions are necessary to eliminate the arbitrary constants in the general solution, thereby narrowing down the infinite family of solutions to a single, unique curve that satisfies both the differential equation and the physical or geometric constraints of the problem. For example, in Example 8, the initial condition (x=-2, y=3) is used to find the constant C=5, ensuring the solution curve passes through the specified point. Without such conditions, the solution remains non-unique due to the presence of arbitrary constants.",
        reasoning: "This answer is accurate as it reflects the source's explanation. The text explicitly states that particular solutions are 'free from arbitrary constants' and are obtained by applying initial conditions (e.g., Example 8, where C=5 is determined using x=-2, y=3). The source also notes that the number of required conditions equals the equation's order.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Given the differential equation d²y/dx² + y = 0 and its general solution y = a cos x + b sin x, explain how you would verify if a proposed particular solution like y = 3 cos x satisfies the equation.",
        correct_answer: "To verify a proposed particular solution, substitute it and its derivatives into the differential equation. For y = 3 cos x, compute the second derivative: y' = -3 sin x, y'' = -3 cos x. Substituting into d²y/dx² + y gives (-3 cos x) + (3 cos x) = 0, which matches the equation. This confirms y = 3 cos x is a valid particular solution. This method aligns with Example 3, where derivatives of the proposed solution are substituted into the original equation.",
        reasoning: "This answer is correct because it follows the verification process described in the source. Examples 2 and 3 explicitly demonstrate substituting the proposed solution and its derivatives into the differential equation to confirm equality, as required by the definition of a solution in Section 9.3.",
    },
    {
        topic: "Variables Separable Method",
        question: "Explain the concept of the Variables Separable Method and the conditions under which it can be applied to solve differential equations.",
        correct_answer: "The Variables Separable Method is a technique used to solve first-order, first-degree differential equations of the form dy/dx = h(y)g(x), where the right-hand side can be expressed as a product of a function of y and a function of x. The method involves rearranging the equation so that all terms involving y are on one side and all terms involving x are on the other, resulting in (1/h(y)) dy = g(x) dx. This separation allows both sides to be integrated independently, yielding the general solution H(y) = G(x) + C, where H and G are antiderivatives of 1/h(y) and g(x), respectively, and C is an arbitrary constant. The method is applicable only when the differential equation can be factored into such a product and h(y) ≠ 0.",
        reasoning: "This answer is correct because it aligns with the source material's definition of the Variables Separable Method (section 9.4.1), which explicitly states the form dy/dx = h(y)g(x) and the requirement for separation. The integration steps and general solution structure are directly derived from the examples and explanations provided, such as in Example 4 and the general solution H(y) = G(x) + C.",
    },
    {
        topic: "Variables Separable Method",
        question: "Describe the step-by-step process for solving a differential equation using the Variables Separable Method.",
        correct_answer: "The process involves four key steps: 1. Rewrite the differential equation dy/dx = h(y)g(x) in separated form by dividing both sides by h(y), yielding (1/h(y)) dy = g(x) dx. 2. Integrate both sides of the equation: ∫(1/h(y)) dy = ∫g(x) dx. 3. Compute the integrals to obtain H(y) = G(x) + C, where H and G are antiderivatives of 1/h(y) and g(x), respectively. 4. Solve for y explicitly if possible, or leave the solution in implicit form. If initial conditions are provided, substitute them into the general solution to determine the constant C and obtain the particular solution.",
        reasoning: "This answer is accurate because it follows the structured approach outlined in the source material (section 9.4.1), which explicitly describes separating variables, integrating both sides, and handling constants. Examples like Example 6 and Example 7 demonstrate these steps, including the use of initial conditions to find particular solutions.",
    },
    {
        topic: "Variables Separable Method",
        question: "Compare and contrast the Variables Separable Method with the Homogeneous Differential Equation method in terms of their applicability and solution processes.",
        correct_answer: "The Variables Separable Method applies to equations of the form dy/dx = h(y)g(x), where variables can be directly separated. In contrast, the Homogeneous Differential Equation method applies to equations dy/dx = g(y/x), which require substitution (e.g., v = y/x) to transform them into separable equations. While both methods ultimately rely on separation of variables, the Homogeneous method introduces an additional substitution step. The Variables Separable Method is more straightforward for equations already factored into x and y components, whereas the Homogeneous method is necessary for equations expressible as functions of y/x.",
        reasoning: "This answer is correct because it reflects the distinctions and overlaps between the two methods as described in sections 9.4.1 (Variables Separable) and 9.4.2 (Homogeneous). The Homogeneous method explicitly uses substitution to reduce the equation to a separable form, a key point in the source material's explanation of homogeneous equations.",
    },
    {
        topic: "Variables Separable Method",
        question: "What is the significance of the arbitrary constant in the general solution obtained via the Variables Separable Method, and how is it determined for a particular solution?",
        correct_answer: "The arbitrary constant C in the general solution H(y) = G(x) + C represents an infinite family of solutions corresponding to different initial conditions. It accounts for the fact that multiple curves satisfy the differential equation, differing only by vertical shifts. For a particular solution, the constant is determined by substituting known values of x and y (initial conditions) into the general solution and solving for C. This ensures the solution curve passes through the specified point, as demonstrated in Examples 6 and 7 of the source material.",
        reasoning: "This answer is valid because it directly references the role of the constant C in the general solution (section 9.4.1) and its determination via initial conditions, as shown in Examples 6 and 7. The explanation aligns with the source's emphasis on the general and particular solutions.",
    },
    {
        topic: "Variables Separable Method",
        question: "How does the Variables Separable Method handle cases where h(y) = 0 in the equation dy/dx = h(y)g(x), and what does this imply about the solutions?",
        correct_answer: "When h(y) = 0 in dy/dx = h(y)g(x), the equation reduces to dy/dx = 0, implying that y is a constant function. These constant solutions, called equilibrium solutions, are valid solutions that are not captured by the general separation process because dividing by h(y) (as in step 1) would be undefined. Such solutions must be identified separately by solving h(y) = 0 and are critical for understanding the full set of solutions, particularly in applications like population dynamics or chemical reactions where steady states are meaningful.",
        reasoning: "This answer is correct because it addresses the special case h(y) = 0, which the source material implicitly acknowledges by specifying h(y) ≠ 0 for separation (section 9.4.1). Equilibrium solutions are a standard consideration in differential equations, as seen in Examples 4–9, where such cases might arise but are not explicitly solved via integration.",
    },
    {
        topic: "Variables Separable Method",
        question: "Explain the concept of the Variables Separable Method for solving differential equations, including the mathematical form required for its application.",
        correct_answer: "The Variables Separable Method applies to first-order, first-degree differential equations that can be expressed in the form dy/dx = h(y)g(x), where h(y) is a function of y alone and g(x) is a function of x alone. The method involves rearranging the equation to separate variables: (1/h(y)) dy = g(x) dx. Integrating both sides yields the general solution H(y) = G(x) + C, where H(y) and G(x) are antiderivatives of 1/h(y) and g(x), respectively. This separation allows independent integration of each variable, simplifying the solution process.",
        reasoning: "This answer is correct because it aligns with the source material's definition of separable equations as those reducible to the product form h(y)g(x). The explanation of variable separation and integration matches the derivation in section 9.4.1, which explicitly shows the transformation into ∫(1/h(y)) dy = ∫g(x) dx.",
    },
    {
        topic: "Variables Separable Method",
        question: "Describe the step-by-step process for solving a differential equation using the Variables Separable Method, including how the constant of integration is handled.",
        correct_answer: "The process involves: 1. Rewriting the equation dy/dx = h(y)g(x) into separated form (1/h(y)) dy = g(x) dx. 2. Integrating both sides: ∫(1/h(y)) dy = ∫g(x) dx + C, where C is the constant of integration. 3. Solving the integrals to obtain H(y) = G(x) + C, where H(y) and G(x) are the antiderivatives. 4. If an initial condition is provided, substituting values to solve for C and obtaining the particular solution. The constant ensures the solution represents a family of curves, with each C value corresponding to a specific curve.",
        reasoning: "This answer is factually accurate as it follows the procedural steps outlined in examples 4-9 of the source material. The emphasis on separating variables, integrating, and handling C aligns with the methodology demonstrated in equations (3) and (4) of section 9.4.1 and subsequent solved examples.",
    },
    {
        topic: "Variables Separable Method",
        question: "What is the significance of ensuring h(y) ≠ 0 in the Variables Separable Method, and how does this affect the solution process?",
        correct_answer: "The condition h(y) ≠ 0 is critical because dividing by h(y) during variable separation would be undefined if h(y) = 0. If h(y) = 0, the original equation dy/dx = 0 implies y is constant, which must be checked separately as a potential solution. Ignoring this condition could lead to missing constant solutions. Thus, the method requires analyzing cases where h(y) = 0 before proceeding with separation to ensure all solutions are accounted for.",
        reasoning: "This answer is correct because the source material explicitly states 'if h(y) ≠ 0' before separating variables (section 9.4.1). The reasoning reflects the need to verify this condition to avoid division by zero and to consider constant solutions, as seen in Example 6 where y=0 would be a trivial solution if allowed.",
    },
    {
        topic: "Variables Separable Method",
        question: "Compare the Variables Separable Method with the general approach to solving differential equations, highlighting why separability simplifies the solution process.",
        correct_answer: "Unlike general differential equations requiring advanced techniques, the Variables Separable Method simplifies solutions by allowing direct integration after variable separation. Most equations cannot be rearranged into separable form, but when they can, the problem reduces to two straightforward integrals. This contrasts with methods for homogeneous or linear equations, which often require substitutions or integrating factors. Separability transforms the problem into evaluating ∫(1/h(y)) dy and ∫g(x) dx independently, avoiding complex manipulations.",
        reasoning: "This answer is accurate because it contrasts separable equations with broader DE-solving approaches, as discussed in sections 9.4.1-9.4.3. The emphasis on reduced complexity through separation aligns with the source's treatment of separable equations as a distinct, simpler category compared to homogeneous or linear cases.",
    },
    {
        topic: "Variables Separable Method",
        question: "What conditions must a differential equation satisfy to be solvable using the Variables Separable Method, and how can these conditions be verified?",
        correct_answer: "A differential equation must be expressible as dy/dx = h(y)g(x), where h(y) and g(x) are continuous functions. To verify: 1. Check if the equation can be factored into a product of a y-dependent term and an x-dependent term. 2. Ensure h(y) ≠ 0 to allow division during separation. If these hold, the equation is separable. For example, dy/dx = (x+1)/(2−y) satisfies this as h(y) = (2−y) and g(x) = (x+1).",
        reasoning: "This answer is correct because it directly references the factorization condition in section 9.4.1, which defines separable equations as those reducible to h(y)g(x). The verification steps mirror the examples provided, such as Example 4, where the equation is explicitly factored.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Explain the concept of a homogeneous differential equation and how its homogeneity is verified.",
        correct_answer: "A homogeneous differential equation is one where the function F(x, y) defining dy/dx can be expressed as a function of the ratio y/x. This is verified by checking if F(λx, λy) = λ^n F(x, y) for some degree n. For first-order equations, homogeneity of degree zero is required, meaning F(λx, λy) = F(x, y). This property allows the substitution y = vx, transforming the equation into a separable form in terms of v and x. The source material emphasizes this substitution as a key step in solving such equations.",
        reasoning: "This answer is correct because it aligns with the source's definition of homogeneous differential equations, which hinges on the function's scalability property (F(λx, λy) = λ^n F(x, y)). The substitution y = vx is explicitly mentioned in the source as the method to exploit this property, confirming the explanation.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Describe the step-by-step process for solving a first-order homogeneous differential equation.",
        correct_answer: "The process involves: 1. Confirming the equation is homogeneous by expressing dy/dx as a function of y/x (e.g., dy/dx = g(y/x)). 2. Substituting y = vx, leading to dy/dx = v + x dv/dx. 3. Substituting into the original equation to separate variables, resulting in a separable equation in v and x. 4. Integrating both sides and solving for v. 5. Replacing v with y/x to obtain the general solution. The source material demonstrates this in examples like Example 10, where substitution simplifies the equation into integrable form.",
        reasoning: "This answer accurately reflects the source's methodology, which explicitly outlines substitution and variable separation as core steps. The reference to Example 10 validates the process described, ensuring alignment with the provided material.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "What is the significance of a homogeneous function having degree zero in the context of differential equations?",
        correct_answer: "A homogeneous function of degree zero ensures that scaling x and y by a factor λ does not change the function's value (F(λx, λy) = F(x, y)). This scale invariance allows the function to be expressed purely in terms of the ratio y/x (e.g., F(x, y) = g(y/x)), enabling the substitution y = vx. This substitution is critical for transforming the equation into a separable form, as shown in the source material's derivation of homogeneous DE solutions.",
        reasoning: "The answer is correct because the source explicitly states that homogeneity of degree zero permits expressing F(x, y) as g(y/x), which is foundational for the substitution method. This reasoning is directly supported by the mathematical examples provided in the text.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Compare and contrast homogeneous differential equations with variable-separable differential equations.",
        correct_answer: "Homogeneous DEs and variable-separable DEs both involve separating variables but differ in structure. Homogeneous DEs require substitution (y = vx) to transform into separable form, while variable-separable DEs are already expressible as dy/dx = g(x)h(y). Homogeneous DEs rely on the ratio y/x for separability, whereas variable-separable DEs inherently split x and y terms. The source highlights this distinction in Section 9.4.2, where substitution is necessary for homogeneity but not for separable equations.",
        reasoning: "This answer is accurate because the source distinguishes between the two types, emphasizing that homogeneous DEs need substitution to achieve separability, unlike inherently separable equations. The reference to Section 9.4.2 confirms this contrast.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "What role does the substitution y = vx play in solving homogeneous differential equations, and why is it effective?",
        correct_answer: "The substitution y = vx introduces a new variable v = y/x, which simplifies the equation by exploiting the homogeneity of degree zero. This transforms dy/dx into v + x dv/dx, converting the original DE into one involving v and x. The resulting equation becomes separable (variables v and x), allowing integration. The source material demonstrates this in Example 11, where substitution reduces the equation to a solvable integral form.",
        reasoning: "The answer is correct because the substitution's purpose—to leverage homogeneity for separability—is explicitly detailed in the source. Example 11 illustrates this transformation, validating the explanation provided.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Explain the concept of a homogeneous differential equation and how to determine if a given function F(x, y) is homogeneous.",
        correct_answer: "A homogeneous differential equation is one where the function F(x, y) in dy/dx = F(x, y) satisfies the condition F(λx, λy) = λ^n F(x, y) for some degree n. For first-order homogeneous equations, n must be zero. To determine if F(x, y) is homogeneous, substitute λx and λy into the function and simplify. If the result factors into λ^n times the original F(x, y), it is homogeneous. For example, F(x, y) = (x² + y²)/xy simplifies to λ⁰·F(x, y), confirming homogeneity of degree zero.",
        reasoning: "This answer aligns with the source's definition of homogeneous functions and the substitution test using λ. The example mirrors the source's treatment of F3(x, y) = cos(y/x), which retains its form under scaling, demonstrating degree-zero homogeneity.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Describe the substitution method used to solve homogeneous differential equations and explain why it works.",
        correct_answer: "The substitution y = vx (or x = vy for dx/dy) transforms a homogeneous DE into a separable equation. By substituting y = vx, dy/dx becomes v + x dv/dx via the product rule. This substitution works because homogeneous DEs have F(x, y) = g(y/x) or h(x/y), allowing variables to be separated in terms of v and x. After substitution, the equation reduces to a form where integration becomes straightforward, as shown in examples like (x−y)dy/dx = x+2y.",
        reasoning: "The answer reflects the source's method of substituting y = vx to exploit the g(y/x) structure of homogeneous DEs. The derivation of dy/dx = v + x dv/dx and its role in separating variables directly matches the step-by-step process in Example 10 of the source.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Compare homogeneous differential equations with variable-separable differential equations, highlighting their key similarities and differences.",
        correct_answer: "Both homogeneous and variable-separable DEs are solved by transforming variables to simplify integration. Homogeneous DEs require substitution (e.g., y = vx) to convert the equation into separable form, while variable-separable DEs already have terms that can be grouped as h(y)dy = g(x)dx. The key difference lies in structure: homogeneous DEs depend on ratios like y/x, whereas separable DEs explicitly factor into functions of x and y. For instance, dy/dx = (x+2y)/(x−y) requires substitution, while dy/dx = (x+1)/(2−y) separates directly.",
        reasoning: "This answer correctly contrasts the structural requirements and solution methods of both DE types, as detailed in Sections 9.4.1 (separable DEs) and 9.4.2 (homogeneous DEs) of the source. The examples cited align with those in the text.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "What is the significance of the degree of a homogeneous function in solving differential equations, and how does it affect the substitution process?",
        correct_answer: "The degree of a homogeneous function determines the substitution strategy. For degree-zero homogeneity (F(λx, λy) = F(x, y)), substitution y = vx or x = vy directly simplifies the DE into separable form. If the degree were non-zero, scaling would not cancel out, complicating the transformation. The source emphasizes degree zero for homogeneous DEs, as seen in F3(x, y) = cos(y/x), which inherently satisfies λ⁰ scaling, enabling the substitution method to work seamlessly.",
        reasoning: "The answer correctly ties the degree (specifically zero) to the feasibility of substitution, as explained in the source's definition of homogeneous functions. The reference to F3(x, y) = cos(y/x) matches the text's examples, where degree-zero homogeneity enables simplification.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Outline the steps to solve a homogeneous differential equation of the form dy/dx = g(y/x), and explain how the substitution eliminates y from the equation.",
        correct_answer: "The steps are: 1. Substitute y = vx, converting y into a product of v and x. 2. Differentiate y = vx to get dy/dx = v + x dv/dx. 3. Substitute dy/dx and y into the original DE, yielding v + x dv/dx = g(v). 4. Rearrange to separate variables: x dv/dx = g(v)−v → dv/(g(v)−v) = dx/x. 5. Integrate both sides and replace v with y/x. This eliminates y by expressing it through v, reducing the DE to a solvable integral form, as demonstrated in Example 11 with trigonometric functions.",
        reasoning: "This answer mirrors the source's procedural explanation in Section 9.4.2, particularly the derivation of equation (4) from substitution and the integration step. The reference to Example 11 aligns with the text's use of trigonometric F(x, y) to illustrate the method.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Explain the concept of an integrating factor in solving linear differential equations and why it is effective.",
        correct_answer: "The integrating factor (I.F.) is a function used to solve first-order linear differential equations of the form dy/dx + P(x)y = Q(x). It is defined as I.F. = e^(∫P(x) dx). Multiplying both sides of the equation by the I.F. transforms the left-hand side into the derivative of the product y * I.F., allowing the equation to be integrated directly. This method works because it leverages the product rule of differentiation, ensuring the left-hand side becomes d/dx [y * I.F.], which simplifies integration and leads to the general solution y = [∫Q(x) * I.F. dx + C] / I.F.",
        reasoning: "This answer is correct because it aligns with the source material's explanation of the integrating factor as a multiplier that converts the differential equation into an exact derivative, enabling straightforward integration. The source explicitly derives the I.F. as e^(∫P dx) and demonstrates its role in solving the equation.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Compare and contrast homogeneous differential equations with linear differential equations, highlighting their key differences and solution methods.",
        correct_answer: "Homogeneous differential equations are of the form dy/dx = F(y/x) and are solved via substitution y = vx, reducing them to separable equations. Linear differential equations, dy/dx + P(x)y = Q(x), are solved using an integrating factor. The key difference lies in their structure: homogeneous equations rely on scaling symmetry (F(λx, λy) = λ^n F(x,y)), while linear equations are affine in y and its derivative. Homogeneous solutions use substitution and separation of variables, whereas linear solutions use integrating factors to exploit exactness.",
        reasoning: "This answer is accurate because the source distinguishes homogeneous equations (Section 9.4.2) as requiring substitution y = vx and linear equations (Section 9.4.3) as requiring integrating factors. The contrast in structure and solution methods is explicitly covered in the material.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Describe the step-by-step process for solving a first-order linear differential equation using the integrating factor method.",
        correct_answer: "The process involves three steps: 1. Rewrite the equation in standard form dy/dx + P(x)y = Q(x). 2. Compute the integrating factor I.F. = e^(∫P(x) dx). 3. Multiply both sides by I.F., yielding d/dx [y * I.F.] = Q(x) * I.F., then integrate both sides to obtain y * I.F. = ∫Q(x) * I.F. dx + C. Finally, solve for y by dividing by I.F. If initial conditions are given, substitute them to find C.",
        reasoning: "This answer is correct as it mirrors the source's outlined steps (Section 9.4.3) for solving linear DEs: standard form identification, integrating factor computation, and integration. The source explicitly details this three-step procedure.",
    },
    {
        topic: "Linear Differential Equations",
        question: "What is the significance of the standard form dy/dx + P(x)y = Q(x) in linear differential equations, and how does it influence the solution approach?",
        correct_answer: "The standard form dy/dx + P(x)y = Q(x) is significant because it identifies the coefficients P(x) and Q(x) required to compute the integrating factor I.F. = e^(∫P(x) dx). This form ensures the equation can be transformed into an exact derivative of y * I.F., enabling integration. Deviating from this form (e.g., dy/dx + P(x)y^2 = Q(x)) would invalidate the integrating factor method, as the product rule would not apply.",
        reasoning: "This answer is correct because the source emphasizes the necessity of the standard form for computing the integrating factor and structuring the solution. The material explicitly requires this form before applying the I.F. method.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Explain how the solution of a linear differential equation differs from that of a separable differential equation, providing examples to illustrate the distinction.",
        correct_answer: "Linear differential equations (dy/dx + P(x)y = Q(x)) require an integrating factor to combine terms into an exact derivative, while separable equations (dy/dx = g(x)h(y)) are solved by separating variables and integrating both sides. For example, dy/dx + y = e^x (linear) uses I.F. = e^x, leading to y = (e^(2x)/2 + C)/e^x. In contrast, dy/dx = x/y (separable) is solved by integrating y dy = x dx, yielding y^2 = x^2 + C. The methods differ fundamentally: linear DEs exploit exactness via I.F., while separable DEs rely on variable separation.",
        reasoning: "This answer is correct as it reflects the source's distinction between the two methods. The source provides examples of both types (e.g., Example 14 for linear and Example 4 for separable) and explicitly describes their solution techniques.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Explain the concept of an integrating factor in solving linear differential equations. Why is it important?",
        correct_answer: "The integrating factor (I.F.) is a function derived from the coefficient of the dependent variable in a linear differential equation. For a first-order linear DE of the form dy/dx + P(x)y = Q(x), the I.F. is calculated as e^(∫P(x)dx). Multiplying the entire equation by this I.F. transforms the left-hand side into the exact derivative of [y * I.F.], enabling direct integration to find the solution. This method is crucial because it systematically converts a non-exact equation into an exact one, simplifying the solution process by leveraging the product rule of differentiation.",
        reasoning: "This answer is correct as it aligns with the source material, which explicitly defines the integrating factor as e^(∫P dx) and emphasizes its role in making the DE exact, allowing the left-hand side to become the derivative of y multiplied by the I.F.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Describe the step-by-step process for solving a first-order linear differential equation.",
        correct_answer: "The process involves five steps: 1. Rewrite the equation in standard form dy/dx + P(x)y = Q(x). 2. Compute the integrating factor (I.F.) as e^(∫P(x)dx). 3. Multiply both sides of the equation by I.F., transforming the left-hand side into the derivative of [y * I.F.]. 4. Integrate both sides with respect to x, resulting in y * I.F. = ∫[Q(x) * I.F.]dx + C. 5. Solve for y by dividing both sides by I.F., yielding the general solution. This method ensures the equation becomes exact and solvable via integration.",
        reasoning: "The source material explicitly outlines these steps, including the derivation of the integrating factor and its application to convert the DE into an integrable form, as demonstrated in Examples 14–18.",
    },
    {
        topic: "Linear Differential Equations",
        question: "What is the significance of the integrating factor in the solution of a linear differential equation?",
        correct_answer: "The integrating factor ensures the differential equation becomes exact by aligning its left-hand side with the derivative of a product. Specifically, multiplying dy/dx + P(x)y = Q(x) by e^(∫P(x)dx) converts the left-hand side into d/dx [y * e^(∫P(x)dx)], which can be directly integrated. This eliminates the need for variable separation or substitution, streamlining the solution process and guaranteeing a structured path to the general solution.",
        reasoning: "The source material emphasizes that the integrating factor's role is to make the DE exact, as shown in the derivation steps where the product rule is applied to y * I.F., validating this explanation.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Compare and contrast the general solution of a linear differential equation with that of a homogeneous differential equation.",
        correct_answer: "The general solution of a linear DE dy/dx + P(x)y = Q(x) is expressed as y = e^(-∫P dx)[∫(Q * e^(∫P dx))dx + C], incorporating an integrating factor. In contrast, a homogeneous DE dy/dx = g(y/x) is solved via substitution y = vx, leading to separable variables and a solution involving v and x. While both methods involve integration, linear DEs rely on exactness via I.F., whereas homogeneous DEs depend on variable substitution and separation. Linear DEs may include non-zero Q(x), while homogeneous DEs inherently lack such terms.",
        reasoning: "The source distinguishes between linear DEs (solved via I.F.) and homogeneous DEs (solved via substitution), as detailed in sections 9.4.2 and 9.4.3, validating the contrast in their solution structures.",
    },
    {
        topic: "Linear Differential Equations",
        question: "How does the presence of the integrating factor affect the structure of the solution to a linear differential equation?",
        correct_answer: "The integrating factor (I.F.) = e^(∫P(x)dx) modifies the DE's structure by ensuring the left-hand side becomes the derivative of [y * I.F.]. This transforms the equation into d/dx [y * I.F.] = Q(x) * I.F., which can be integrated directly. The solution then takes the form y = (1/I.F.)[∫(Q * I.F.)dx + C], embedding the I.F. in both the integration process and the final expression. This structure guarantees that the solution inherently accounts for the nonhomogeneous term Q(x) through weighted integration.",
        reasoning: "The source material explicitly derives this structure, showing how multiplying by I.F. collapses the DE into a single derivative term, as seen in the steps leading to the general solution formula.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "Explain the significance of determining the order and degree of a differential equation in the context of solving it.",
        correct_answer: "The order and degree of a differential equation are critical in understanding its complexity and solution approach. The order, defined as the highest derivative present, indicates the number of initial conditions required to uniquely determine a particular solution. For example, a second-order equation requires two initial conditions. The degree, which is the power of the highest-order derivative (when the equation is a polynomial in derivatives), influences the nature of solutions. A first-degree equation typically admits classical analytical methods, while higher-degree or non-polynomial equations (where degree is undefined) may require numerical or qualitative approaches. Together, these properties guide the choice of solution techniques and reveal the equation's mathematical structure.",
        reasoning: "This answer is correct because it aligns with the source's definitions of order and degree, emphasizing their roles in solution uniqueness and method selection. It references the source's examples, such as the distinction between equations with defined vs. undefined degrees.",
    },
    {
        topic: "Homogeneous Differential Equations",
        question: "Describe the step-by-step process for solving a first-order homogeneous differential equation.",
        correct_answer: "Solving a homogeneous differential equation involves three key steps: First, verify homogeneity by confirming the equation can be expressed as dy/dx = g(y/x), where g is a function of the ratio y/x. Second, substitute y = vx (where v is a function of x), leading to dy/dx = v + x dv/dx. Third, substitute into the original equation to separate variables, resulting in an equation in terms of v and x. This transformed equation is solved via integration, and the solution is reverted to the original variables by replacing v with y/x. This method leverages substitution to simplify the equation into a separable form.",
        reasoning: "This answer accurately reflects the source's explanation of homogeneous DEs, including the substitution y = vx and the transformation into a separable equation. It adheres to the step-by-step procedure outlined in the text.",
    },
    {
        topic: "Linear Differential Equations",
        question: "What is the role of the integrating factor in solving first-order linear differential equations, and how is it derived?",
        correct_answer: "The integrating factor (I.F.) is a function that transforms a linear differential equation of the form dy/dx + P(x)y = Q(x) into an exact equation, enabling direct integration. It is derived as I.F. = e^(∫P(x)dx), obtained by solving the condition that the left-hand side becomes the derivative of y·I.F. Multiplying both sides by the I.F. ensures the equation can be written as d/dx [y·I.F.] = Q(x)·I.F., which is integrated to yield the general solution y = [∫(Q·I.F.)dx + C]/I.F. This method systematically reduces the DE to an integrable form.",
        reasoning: "This answer is correct as it explains the purpose and derivation of the integrating factor, matching the source's detailed steps for solving linear DEs. It references the mathematical derivation and the resulting integrable form described in the text.",
    },
    {
        topic: "Applications of Differential Equations",
        question: "Compare and contrast the use of differential equations in modeling population growth versus radioactive decay.",
        correct_answer: "Both population growth and radioactive decay are modeled using first-order differential equations, but they differ in their rate dependencies. Population growth follows dP/dt = kP, where the growth rate (k) is positive, leading to exponential growth. Radioactive decay uses dN/dt = -kN, with a negative rate constant, resulting in exponential decay. The key contrast lies in the sign of the proportionality constant, which determines whether the quantity increases or decreases over time. Both models rely on the principle of proportionality between the rate of change and the current quantity, but their applications diverge based on the physical context.",
        reasoning: "This answer is accurate because it highlights the shared mathematical structure (first-order linearity) and the critical difference in the sign of the rate constant, as discussed in the source's examples of real-world applications.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Explain the difference between general and particular solutions of a differential equation, and why arbitrary constants are eliminated in the latter.",
        correct_answer: "The general solution of a differential equation contains arbitrary constants equal to the equation's order, representing an infinite family of solutions. For example, a second-order DE has two constants. A particular solution is derived by applying initial or boundary conditions to determine these constants, eliminating their arbitrariness. This elimination is necessary to obtain a unique solution that satisfies specific physical or geometric constraints. For instance, in the equation d²y/dx² + y = 0, the general solution y = a sin(x + b) includes constants a and b, but given y(0) = 1 and y'(0) = 0, these constants are fixed, yielding a particular solution.",
        reasoning: "This answer is correct as it distinguishes general and particular solutions using the source's definitions and examples, such as the role of initial conditions in fixing constants.",
    },
    {
        topic: "General and Particular Solutions",
        question: "Explain the concept of a general solution versus a particular solution of a differential equation, and why the distinction is important in solving real-world problems.",
        correct_answer: "A general solution of a differential equation contains arbitrary constants equal to the order of the equation, representing an infinite family of solutions. For example, y = a sin(x + b) is a general solution to y'' + y = 0, with constants a and b. A particular solution is derived by assigning specific values to these constants based on initial or boundary conditions, such as y = 2 sin(x + π/4) when a = 2 and b = π/4. This distinction is crucial because real-world problems often require unique solutions tailored to specific scenarios, like predicting population growth at a given time or determining the trajectory of a moving object under defined initial conditions.",
        reasoning: "This answer is correct because it aligns with the source material's definition of general and particular solutions (Section 9.3), which explicitly uses examples like y = a sin(x + b) and emphasizes the role of arbitrary constants. The distinction is vital for applying differential equations to practical problems where initial conditions are known.",
    },
    {
        topic: "Homogeneous vs. Non-Homogeneous Equations",
        question: "Compare and contrast homogeneous and non-homogeneous differential equations, focusing on their structure and solution methods.",
        correct_answer: "Homogeneous differential equations can be expressed as dy/dx = F(y/x), where F is a homogeneous function of degree zero, and are solved via substitutions like y = vx. For example, dy/dx = (x + y)/(x - y) is homogeneous. Non-homogeneous equations, such as dy/dx + P(x)y = Q(x), include terms not proportional to y or its derivatives (e.g., Q(x) ≠ 0). Their solutions involve finding an integrating factor (e.g., e^{∫P(x)dx}) and combining homogeneous solutions with particular integrals. Homogeneous equations rely on variable separation after substitution, while non-homogeneous ones require additional steps to account for external forcing terms.",
        reasoning: "This answer is accurate because it reflects the source's treatment of homogeneous equations (Section 9.4.2) and linear non-homogeneous equations (Section 9.4.3), including solution methods like substitution for homogeneity and integrating factors for linearity. The contrast in structure and approach is explicitly covered in the examples provided.",
    },
    {
        topic: "Linear Differential Equations",
        question: "Describe the step-by-step process for solving a first-order linear differential equation using an integrating factor, and explain why this method works.",
        correct_answer: "To solve a first-order linear DE of the form dy/dx + P(x)y = Q(x): 1. Identify P(x) and Q(x). 2. Compute the integrating factor (I.F.) as e^{∫P(x)dx}. 3. Multiply both sides of the DE by the I.F., transforming the left-hand side into the derivative of y × I.F. 4. Integrate both sides: y × I.F. = ∫(Q(x) × I.F.)dx + C. 5. Solve for y. This works because the integrating factor ensures the left-hand side becomes a perfect derivative, simplifying integration. For example, solving dy/dx - y = cos(x) uses I.F. = e^{-x}, leading to y = (sin(x) - cos(x))/2 + Ce^{x}.",
        reasoning: "This answer is correct as it follows the source's detailed steps for linear DEs (Section 9.4.3), including the role of the integrating factor in creating a perfect derivative. The example mirrors the method used in Example 14 of the source, validating the explanation.",
    },
    {
        topic: "Order and Degree of Differential Equations",
        question: "What is the significance of the order and degree of a differential equation in determining its solution method and the number of required initial conditions?",
        correct_answer: "The order of a differential equation (the highest derivative present) determines the number of initial conditions needed for a unique solution. For instance, a second-order equation like y'' + y = 0 requires two conditions (e.g., y(0) and y'(0)). The degree (the power of the highest-order derivative when expressed as a polynomial) affects the equation's linearity and solvability. First-degree equations (e.g., dy/dx = e^x) are typically solvable via standard methods, while higher-degree equations (e.g., (dy/dx)^2 + y = 0) may require specialized approaches. These properties guide the choice of solution techniques, such as separation of variables for first-order equations or characteristic equations for linear higher-order DEs.",
        reasoning: "This answer is factually correct based on the source's discussion of order and degree (Section 9.2.1-9.2.2), which explicitly links order to the number of arbitrary constants and initial conditions. The degree's impact on solvability is illustrated in examples like equations (9)-(11) of the source.",
    },
    {
        topic: "Applications of Differential Equations",
        question: "How are differential equations applied to model real-world phenomena such as population growth, radioactive decay, or geometric problems? Provide specific examples.",
        correct_answer: "Differential equations model systems where rates of change depend on current states. For population growth, dP/dt = kP describes exponential growth (k > 0) or decay (k < 0), as seen in Example 9 (bank principal doubling). Radioactive decay follows similar equations, with half-life derived from dN/dt = -λN. In geometry, DEs like dy/dx = 2x describe curves (e.g., parabolas y = x² + C) or, in Example 8, determine paths with specified tangent slopes. Homogeneous equations model geometric scaling, such as dy/dx = y/x for straight lines through the origin. These applications demonstrate DEs' universality in physics, biology, and economics for predicting dynamic behavior.",
        reasoning: "This answer is accurate because it references the source's examples, such as Example 9 (population-like growth in banking) and geometric problems (Section 9.4.1-9.4.3). The connection between DEs and real-world rates of change is emphasized in the source's introduction and exercise problems.",
    },
]